tutorials/myoverLusgsFoam/oversetNACA/canal/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topAndBottom
    {
        type            patch;
        nFaces          72;
        startFace       15445;
    }
    inlet
    {
        type            patch;
        nFaces          34;
        startFace       15517;
    }
    outlet
    {
        type            patch;
        nFaces          34;
        startFace       15551;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          15538;
        startFace       15585;
    }
    oversetPatch
    {
        type            overset;
        inGroups        1(overset);
        nFaces          152;
        startFace       31123;
    }
    wallsWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          314;
        startFace       31275;
    }
)

// ************************************************************************* //
