tutorials/myoverLusgsFoam/oversetNACA/canal/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
  rho 
    {
      solver diag;
    }

  rhoU 
    {
      solver diag;
    }

  rhoE 
    {
      solver diag;
    }
    
    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;

        tolerance       1e-06;
        relTol          0;
        maxIter         100;
    }
    
    yPsi
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0.0;
    }
    
     "(k|omega)"
    {
        solver          smoothSolver;
        smoother       DILUGaussSeidel;
        tolerance       1e-6;
        relTol          0.01;
        minIter         1;
    }
  
}

LUSGS {
  internalIterations 1;
  localTimestepping true;
}

fieldBounds
{
    rho 0.01 10;
    p   100 1e6;
    T   10 800;
}

relaxationFactors
{
    equations
    {
        k               0.7;
        omega           0.7;
    }
}


// ************************************************************************* //
